package lesson14;

import java.util.List;
import java.util.Random;

public class Fio {

    private static final List<String> NAMES = List.of("Андрей", "Алексей", "Антон", "Артур", "Александр", "Борис", "Владимир", "Валентин", "Виктор",
            "Василий", "Геннадий", "Григорий", "Дмитрий", "Даниил", "Денис", "Евгений", "Жора", "Иван", "Ираклий", "Константин", "Коля",
            "Леонид", "Михаил", "Митрофан", "Николай", "Олег", "Петр", "Рустам", "Ринат", "Рудик", "Рамиль", "Радмир", "Станислав", "Семен",
            "Тимофей", "Тимур", "Федор", "Харитон", "Шамиль", "Эдуард", "Юрий");
    private static final List<String> SURNAMES = List.of("Алексеев", "Андреев", "Амиров", "Борисов", "Байдимиров", "Брычков", "Батунин", "Владимиров",
            "Васин", "Виноградов", "Васечкин", "Волков", "Григорьев", "Гришин", "Донской", "Дмитриев", "Ежов", "Житнев", "Зайцев", "Ившин", "Ковшов",
            "Козлов", "Катков", "Лаптев", "Лисин", "Ломакин", "Мишин", "Матвеев", "Миронов", "Мальцев", "Николаев", "Никитин", "Петров", "Пупкин",
            "Потапов", "Ромашкин", "Рачков", "Рыков", "Самарин", "Сытин", "Семенов", "Темеев", "Тимофеев", "Тычков", "Федоров", "Фадеев", "Харитонов",
            "Шмаров", "Шалимов", "Юрьев", "Ярцев");

    public static String randomName() {
        return random(NAMES);
    }

    public static String randomSurname() {
        return random(SURNAMES);
    }

    private static String random(List<String> values) {
        return values.get(new Random().nextInt(values.size()));
    }
}
